In [1]:
import numpy as np

### 여러 행렬

In [10]:
np.zeros(9)

array([0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [11]:
np.zeros((3,3))

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [12]:
np.ones(9)

array([1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [13]:
np.ones((3,3))

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [14]:
np.eye(5)

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

In [15]:
np.identity(5)

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

### 배열의 연산

In [16]:
a = np.arange(1.0, 7)
b = np.arange(10.0, 70, 10)

#repr은 클래스에서 __repr__을 호출하는 함수
print('a:%s \t shape:%s' %(repr(a), a.shape))
print('b:%s \t shape:%s' %(repr(b), b.shape))

a:array([1., 2., 3., 4., 5., 6.]) 	 shape:(6,)
b:array([10., 20., 30., 40., 50., 60.]) 	 shape:(6,)

In [17]:
a+100

array([101., 102., 103., 104., 105., 106.])

In [18]:
a+b

array([11., 22., 33., 44., 55., 66.])

In [19]:
b-a

array([ 9., 18., 27., 36., 45., 54.])

In [20]:
a*b

array([ 10.,  40.,  90., 160., 250., 360.])

In [21]:
a/b

array([0.1, 0.1, 0.1, 0.1, 0.1, 0.1])

In [22]:
a**b

array([1.00000000e+00, 1.04857600e+06, 2.05891132e+14, 1.20892582e+24,
       8.88178420e+34, 4.88736780e+46])

In [23]:
b>20

array([False, False,  True,  True,  True,  True])

In [25]:
b[[False, False,  True,  True,  True,  True]]

array([30., 40., 50., 60.])

In [28]:
a=np.arange(1,9).reshape(2,4)
b=np.arange(10,90,10).reshape(2,4)

print('a: %s \t\t shape:%s' % (repr(a), a.shape))
print('b: %s \t shape:%s' % (repr(b), b.shape))

a: array([[1, 2, 3, 4],
       [5, 6, 7, 8]]) 		 shape:(2, 4)
b: array([[10, 20, 30, 40],
       [50, 60, 70, 80]]) 	 shape:(2, 4)

In [29]:
a*b

array([[ 10,  40,  90, 160],
       [250, 360, 490, 640]])

In [30]:
a.sum()

36

In [31]:
a.mean()

4.5

In [32]:
a.std()

2.29128784747792

In [33]:
a.var()

5.25

In [34]:
a.min()

1

In [35]:
a.max()

8

In [36]:
a.cumsum()

array([ 1,  3,  6, 10, 15, 21, 28, 36], dtype=int32)

In [37]:
a.cumprod()

array([    1,     2,     6,    24,   120,   720,  5040, 40320],
      dtype=int32)

In [38]:
a=np.arange(1,7).reshape(2,3)
b=np.arange(6,0,-1).reshape(3,2)

print("a: %s" % repr(a))
print("b: %s" % repr(b))

a: array([[1, 2, 3],
       [4, 5, 6]])
b: array([[6, 5],
       [4, 3],
       [2, 1]])

### 행렬곱

In [39]:
a.dot(b)

array([[20, 14],
       [56, 41]])

In [41]:
np.matmul(a,b)

array([[20, 14],
       [56, 41]])

In [40]:
a@b

array([[20, 14],
       [56, 41]])

### 전치행렬

In [42]:
a.transpose()

array([[1, 4],
       [2, 5],
       [3, 6]])

In [43]:
np.transpose(a)

array([[1, 4],
       [2, 5],
       [3, 6]])

In [44]:
a.T

array([[1, 4],
       [2, 5],
       [3, 6]])

In [45]:
a=np.arange(1,5).reshape(2,2)
b=np.arange(4,0,-1).reshape(2,2)

print("a: %s" % repr(a))
print("b: %s" % repr(b))

a: array([[1, 2],
       [3, 4]])
b: array([[4, 3],
       [2, 1]])

### 단위행렬

In [46]:
i = np.eye(2)

In [49]:
a@i

array([[1., 2.],
       [3., 4.]])

In [50]:
b@i

array([[4., 3.],
       [2., 1.]])

In [52]:
ai=np.linalg.inv(a)
ai

array([[-2. ,  1. ],
       [ 1.5, -0.5]])

In [53]:
a@ai

array([[1.00000000e+00, 1.11022302e-16],
       [0.00000000e+00, 1.00000000e+00]])

### 역행렬

In [55]:
bi=np.linalg.inv(b)
bi

array([[-0.5,  1.5],
       [ 1. , -2. ]])

In [56]:
bi@b

array([[1., 0.],
       [0., 1.]])

### 행렬식

In [57]:
np.linalg.det(a)

-2.0000000000000004

In [58]:
np.linalg.det(b)

-2.0

In [60]:
a=np.arange(24).reshape(4,6)
a

array([[ 0,  1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10, 11],
       [12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23]])

In [64]:
i=np.eye(6)
i

array([[1., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 1.]])

In [65]:
a@i

array([[ 0.,  1.,  2.,  3.,  4.,  5.],
       [ 6.,  7.,  8.,  9., 10., 11.],
       [12., 13., 14., 15., 16., 17.],
       [18., 19., 20., 21., 22., 23.]])

# 모듈

In [1]:
import random #random은 모듈 #그냥 이렇게 import모듈만 하면 [모듈이름].[함수이름](인자) 형태로 작성해야한다.
random.randint(5,10)

7

In [2]:
dir(random)

['BPF',
 'LOG4',
 'NV_MAGICCONST',
 'RECIP_BPF',
 'Random',
 'SG_MAGICCONST',
 'SystemRandom',
 'TWOPI',
 '_BuiltinMethodType',
 '_MethodType',
 '_Sequence',
 '_Set',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 '_acos',
 '_bisect',
 '_ceil',
 '_cos',
 '_e',
 '_exp',
 '_inst',
 '_itertools',
 '_log',
 '_os',
 '_pi',
 '_random',
 '_sha512',
 '_sin',
 '_sqrt',
 '_test',
 '_test_generator',
 '_urandom',
 '_warn',
 'betavariate',
 'choice',
 'choices',
 'expovariate',
 'gammavariate',
 'gauss',
 'getrandbits',
 'getstate',
 'lognormvariate',
 'normalvariate',
 'paretovariate',
 'randint',
 'random',
 'randrange',
 'sample',
 'seed',
 'setstate',
 'shuffle',
 'triangular',
 'uniform',
 'vonmisesvariate',
 'weibullvariate']

In [69]:
from random import randint
randint(10,15)

10

In [8]:
from random import * # *은 와일드 카드. 다 가져오겠다는 뜻 # 이러면 [함수이름](인자)만으로도 실행가능. 가져올수 있는 함수 리스트는 C:\Users\Funzo\Anaconda3\envs\study\Lib 안에 들어있는 모듈 파일들어가서 __all__을 보면 된다.
random()

0.03193061324846447

In [9]:
dir(random) #위에서 한거랑 조금다름

['__call__',
 '__class__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__name__',
 '__ne__',
 '__new__',
 '__qualname__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__self__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__text_signature__']

In [5]:
uniform(1,2)

1.1099915413942836

In [72]:
import json #json은 패키지

In [73]:
from json import encoder #encoder는 모듈

In [74]:
encoder.JSONEncoder #JSONEncoder는 함수

json.encoder.JSONEncoder

In [75]:
from json.encoder import JSONEncoder #(패키지.모듈) 에서  JSONEncoder라는 함수를 가져온다.
JSONEncoder

json.encoder.JSONEncoder

In [76]:
import json.encoder

In [77]:
encoder

In [78]:
encoder.JSONEncoder

json.encoder.JSONEncoder

In [79]:
import sys

In [80]:
sys.path

['C:\\Users\\Funzo\\python gicho',
 'C:\\Users\\Funzo\\Anaconda3\\python37.zip',
 'C:\\Users\\Funzo\\Anaconda3\\DLLs',
 'C:\\Users\\Funzo\\Anaconda3\\lib',
 'C:\\Users\\Funzo\\Anaconda3',
 '',
 'C:\\Users\\Funzo\\Anaconda3\\lib\\site-packages',
 'C:\\Users\\Funzo\\Anaconda3\\lib\\site-packages\\win32',
 'C:\\Users\\Funzo\\Anaconda3\\lib\\site-packages\\win32\\lib',
 'C:\\Users\\Funzo\\Anaconda3\\lib\\site-packages\\Pythonwin',
 'C:\\Users\\Funzo\\Anaconda3\\lib\\site-packages\\IPython\\extensions',
 'C:\\Users\\Funzo\\.ipython']

In [81]:
from mypackage import calc_modules

In [83]:
calc_modules.sum_calc(5,3)

8

In [11]:
from mypackage.calc_modules import Calculator
a=Calculator()
a

In [ ]:
# anaconda3.Lib안에다가 생성해서 쓰는방법이 1
# python gicho안에 넣어서 쓰는방법이 2
# init.py가 꼭 있어야 한다.

# 판다스

## Series

In [19]:
#아나콘다 네비게이터 - environment - all - pandas검색 후 체크, apply로 설치
import pandas as pd
import numpy as np

In [20]:
s=pd.Series([1,3,4,np.nan,6,8])
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [22]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [23]:
s.values

array([ 1.,  3.,  4., nan,  6.,  8.])

In [24]:
s1 = pd.Series([1,2,3,4,np.nan,np.inf, 'a','b','c'])
s1
#object타입

0      1
1      2
2      3
3      4
4    NaN
5    inf
6      a
7      b
8      c
dtype: object

In [25]:
s1.values

array([1, 2, 3, 4, nan, inf, 'a', 'b', 'c'], dtype=object)

## index 설정하기

In [27]:
index_seq = range(10,20)
seq_data = range(10)
s2 = pd.Series(data=seq_data, index=index_seq)
s2

10    0
11    1
12    2
13    3
14    4
15    5
16    6
17    7
18    8
19    9
dtype: int64

In [28]:
index_date = ['2018-10-17', '2018-10-18', '2018-10-19', '2018-10-20']
s3 = pd.Series([200, 195, np.nan, 205], index=index_date)
s3

2018-10-17    200.0
2018-10-18    195.0
2018-10-19      NaN
2018-10-20    205.0
dtype: float64

## 딕셔너리로 시리즈입력

In [29]:
#key->index, value->value
dict_data = {
    '국어': 100,
    '영어': 95,
    '수학': 80
}
s5 = pd.Series(dict_data)
print(s5)

국어    100
영어     95
수학     80
dtype: int64

In [33]:
s1 = pd.Series((range(10, 70, 10)))
s2 = pd.Series((range(1, 6)))

print(repr(s1))
print(repr(s2))

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [34]:
s1+s2

0    11.0
1    22.0
2    33.0
3    44.0
4    55.0
5     NaN
dtype: float64

In [35]:
s1-s2

0     9.0
1    18.0
2    27.0
3    36.0
4    45.0
5     NaN
dtype: float64

In [36]:
s1*s2

0     10.0
1     40.0
2     90.0
3    160.0
4    250.0
5      NaN
dtype: float64

In [37]:
s1/s2

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
5     NaN
dtype: float64

In [38]:
s1//s2

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
5     NaN
dtype: float64

In [39]:
s1%s2

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
5    NaN
dtype: float64

In [42]:
pd.date_range('2019-05-25', '2020-06-01', freq='M')

DatetimeIndex(['2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31',
               '2019-09-30', '2019-10-31', '2019-11-30', '2019-12-31',
               '2020-01-31', '2020-02-29', '2020-03-31', '2020-04-30',
               '2020-05-31'],
              dtype='datetime64[ns]', freq='M')

In [43]:
pd.date_range('2019-05-25', periods = 4)

DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')

In [44]:
pd.date_range(start='2019-05-25 10:00:00', periods = 5)

DatetimeIndex(['2019-05-25 10:00:00', '2019-05-26 10:00:00',
               '2019-05-27 10:00:00', '2019-05-28 10:00:00',
               '2019-05-29 10:00:00'],
              dtype='datetime64[ns]', freq='D')

In [46]:
date_index1= pd.date_range(start = '2019-05-25', periods = 4)
date_index2= pd.date_range(start = '2019.05.25', periods = 4)
date_index3= pd.date_range(start = '2019/05/25', periods = 4)
print(repr(date_index1))
print(repr(date_index2))
print(repr(date_index3))

DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')

In [47]:
date_index1= pd.date_range(start = '05-25-2019', periods = 4)
date_index2= pd.date_range(start = '05.25.2019', periods = 4)
date_index3= pd.date_range(start = '05/25/2019', periods = 4)
print(repr(date_index1))
print(repr(date_index2))
print(repr(date_index3))

DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')

In [48]:
pd.date_range(start='2019-05-25', periods = 8, freq = '2D')

DatetimeIndex(['2019-05-25', '2019-05-27', '2019-05-29', '2019-05-31',
               '2019-06-02', '2019-06-04', '2019-06-06', '2019-06-08'],
              dtype='datetime64[ns]', freq='2D')

In [49]:
pd.date_range(start='2019-05-25', periods = 8, freq = 'B')

DatetimeIndex(['2019-05-27', '2019-05-28', '2019-05-29', '2019-05-30',
               '2019-05-31', '2019-06-03', '2019-06-04', '2019-06-05'],
              dtype='datetime64[ns]', freq='B')

In [50]:
pd.date_range(start='2019-05-25', periods = 8, freq = '3W')

DatetimeIndex(['2019-05-26', '2019-06-16', '2019-07-07', '2019-07-28',
               '2019-08-18', '2019-09-08', '2019-09-29', '2019-10-20'],
              dtype='datetime64[ns]', freq='3W-SUN')

In [51]:
pd.date_range(start='2019-05-25', periods = 8, freq = 'BM')

DatetimeIndex(['2019-05-31', '2019-06-28', '2019-07-31', '2019-08-30',
               '2019-09-30', '2019-10-31', '2019-11-29', '2019-12-31'],
              dtype='datetime64[ns]', freq='BM')

In [53]:
pd.date_range(start='2019-05-25', periods = 8, freq = 'BMS')

DatetimeIndex(['2019-06-03', '2019-07-01', '2019-08-01', '2019-09-02',
               '2019-10-01', '2019-11-01', '2019-12-02', '2020-01-01'],
              dtype='datetime64[ns]', freq='BMS')

In [54]:
pd.date_range(start='2019-05-25', periods = 8, freq = 'Q')

DatetimeIndex(['2019-06-30', '2019-09-30', '2019-12-31', '2020-03-31',
               '2020-06-30', '2020-09-30', '2020-12-31', '2021-03-31'],
              dtype='datetime64[ns]', freq='Q-DEC')

In [55]:
pd.date_range(start='2019-05-25', periods = 8, freq = 'A')

DatetimeIndex(['2019-12-31', '2020-12-31', '2021-12-31', '2022-12-31',
               '2023-12-31', '2024-12-31', '2025-12-31', '2026-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [56]:
pd.date_range(start='2019-05-25', periods = 8, freq = 'H')

DatetimeIndex(['2019-05-25 00:00:00', '2019-05-25 01:00:00',
               '2019-05-25 02:00:00', '2019-05-25 03:00:00',
               '2019-05-25 04:00:00', '2019-05-25 05:00:00',
               '2019-05-25 06:00:00', '2019-05-25 07:00:00'],
              dtype='datetime64[ns]', freq='H')

In [57]:
pd.date_range(start='2019-05-25', periods = 8, freq = 'min')

DatetimeIndex(['2019-05-25 00:00:00', '2019-05-25 00:01:00',
               '2019-05-25 00:02:00', '2019-05-25 00:03:00',
               '2019-05-25 00:04:00', '2019-05-25 00:05:00',
               '2019-05-25 00:06:00', '2019-05-25 00:07:00'],
              dtype='datetime64[ns]', freq='T')

In [58]:
pd.date_range(start='2019-05-25', periods = 8, freq = '10S')

DatetimeIndex(['2019-05-25 00:00:00', '2019-05-25 00:00:10',
               '2019-05-25 00:00:20', '2019-05-25 00:00:30',
               '2019-05-25 00:00:40', '2019-05-25 00:00:50',
               '2019-05-25 00:01:00', '2019-05-25 00:01:10'],
              dtype='datetime64[ns]', freq='10S')

# DataFrame

In [61]:
df = pd.DataFrame([[10,20,30],[4,5,6],[7,8,9]])
df

    0   1   2
0  10  20  30
1   4   5   6
2   7   8   9

In [62]:
type(df)

pandas.core.frame.DataFrame

In [65]:
np_array = np.arange(10,100,10).reshape(3,3)
df1 = pd.DataFrame(np_array)
df1

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [66]:
df1.index = pd.date_range('2019-05-05', periods = 3)
df1

             0   1   2
2019-05-05  10  20  30
2019-05-06  40  50  60
2019-05-07  70  80  90

In [67]:
df1.index

DatetimeIndex(['2019-05-05', '2019-05-06', '2019-05-07'], dtype='datetime64[ns]', freq='D')

In [68]:
df1.columns = ['a','b','c']
df1

             a   b   c
2019-05-05  10  20  30
2019-05-06  40  50  60
2019-05-07  70  80  90

In [72]:
df2 = pd.DataFrame(np.arange(10,100,10).reshape(3,3),
                  index=pd.date_range('2015-05-05',periods = 3),
                  columns=['a','b','c'])
df2

             a   b   c
2015-05-05  10  20  30
2015-05-06  40  50  60
2015-05-07  70  80  90

In [73]:
table_data = {'연도':list(range(2010, 2020)),
              '매출액': [v**2 for i, v in enumerate(range(1,11))],
              '종업원 수': list(range(2, 30, 3))}


df = pd.DataFrame(table_data)
df

     연도  매출액  종업원 수
0  2010    1      2
1  2011    4      5
2  2012    9      8
3  2013   16     11
4  2014   25     14
5  2015   36     17
6  2016   49     20
7  2017   64     23
8  2018   81     26
9  2019  100     29

In [76]:
df.head()

     연도  매출액  종업원 수
0  2010    1      2
1  2011    4      5
2  2012    9      8
3  2013   16     11
4  2014   25     14

In [78]:
df.tail(3)

     연도  매출액  종업원 수
7  2017   64     23
8  2018   81     26
9  2019  100     29

In [81]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [82]:
df.values

array([[2010,    1,    2],
       [2011,    4,    5],
       [2012,    9,    8],
       [2013,   16,   11],
       [2014,   25,   14],
       [2015,   36,   17],
       [2016,   49,   20],
       [2017,   64,   23],
       [2018,   81,   26],
       [2019,  100,   29]], dtype=int64)

In [83]:
df.columns

Index(['연도', '매출액', '종업원 수'], dtype='object')

In [84]:

table_data1 = {
    'A': np.arange(1, 6),
    'B': np.arange(10, 60, 10),
    'C': np.arange(100, 600, 100),
}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [85]:

table_data2 = {
    'A': [6, 7, 8],
    'B': [60, 70, 80],
    'C': [600, 700, 800],
}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [87]:
df1+df2  #심심하면 사칙연산 //, % 다해보든가

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [88]:
df1 = pd.DataFrame({'봄': [256.5, 264.3, 215.9, 223.2, 312.8],
                    '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
                    '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
                    '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]},
                    index=['2012', '2013', '2014', '2015', '2016'])
df1

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [89]:
df1.sum()

봄     1272.7
여름    2771.2
가을    1517.1
겨울     493.3
dtype: float64

In [91]:
df1.sum(axis=0)

봄     1272.7
여름    2771.2
가을    1517.1
겨울     493.3
dtype: float64

In [90]:
df1.sum(axis=1)

2012    1529.9
2013    1122.9
2014    1185.7
2015     967.1
2016    1248.7
dtype: float64

In [92]:
df1.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [93]:
df1.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [94]:
df1.max()

봄     312.8
여름    770.6
가을    381.6
겨울    139.3
dtype: float64

In [95]:
df1.min()

봄     215.9
여름    387.1
가을    231.2
겨울     59.9
dtype: float64

In [96]:
df1.cumsum()

           봄      여름      가을     겨울
2012   256.5   770.6   363.5  139.3
2013   520.8  1338.1   594.7  199.2
2014   736.7  1937.9   887.8  276.1
2015   959.9  2325.0  1135.5  385.2
2016  1272.7  2771.2  1517.1  493.3

# describe()

In [97]:
df1.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [100]:
df1.T.describe()

             2012        2013        2014       2015        2016
count    4.000000    4.000000    4.000000    4.00000    4.000000
mean   382.475000  280.725000  296.425000  241.77500  312.175000
std    274.472128  211.128782  221.150739  114.16676  146.548658
min    139.300000   59.900000   76.900000  109.10000  108.100000
25%    227.200000  188.375000  181.150000  194.67500  261.625000
50%    310.000000  247.750000  254.500000  235.45000  347.200000
75%    465.275000  340.100000  369.775000  282.55000  397.750000
max    770.600000  567.500000  599.800000  387.10000  446.200000

In [101]:
df.info() #결측치가 있는지도 확인할 수 있다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
연도       10 non-null int64
매출액      10 non-null int64
종업원 수    10 non-null int64
dtypes: int64(3)
memory usage: 320.0 bytes

In [102]:
df1['봄']

2012    256.5
2013    264.3
2014    215.9
2015    223.2
2016    312.8
Name: 봄, dtype: float64

In [103]:
df1[['봄','여름']]

          봄     여름
2012  256.5  770.6
2013  264.3  567.5
2014  215.9  599.8
2015  223.2  387.1
2016  312.8  446.2

In [104]:
df1[1:3]

          봄     여름     가을    겨울
2013  264.3  567.5  231.2  59.9
2014  215.9  599.8  293.1  76.9

In [105]:
df1[:'2013']

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9

In [106]:
df1.loc['2013']

봄     264.3
여름    567.5
가을    231.2
겨울     59.9
Name: 2013, dtype: float64

In [107]:
df1.loc['2013':'2016']

          봄     여름     가을     겨울
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [108]:
df1['여름'][:'2014']

2012    770.6
2013    567.5
2014    599.8
Name: 여름, dtype: float64

In [110]:
df1.loc['2013':,'여름':]

         여름     가을     겨울
2013  567.5  231.2   59.9
2014  599.8  293.1   76.9
2015  387.1  247.7  109.1
2016  446.2  381.6  108.1

In [111]:
df1.T

     2012   2013   2014   2015   2016
봄   256.5  264.3  215.9  223.2  312.8
여름  770.6  567.5  599.8  387.1  446.2
가을  363.5  231.2  293.1  247.7  381.6
겨울  139.3   59.9   76.9  109.1  108.1

In [112]:
df1[['겨울','봄','여름','가을']]

         겨울      봄     여름     가을
2012  139.3  256.5  770.6  363.5
2013   59.9  264.3  567.5  231.2
2014   76.9  215.9  599.8  293.1
2015  109.1  223.2  387.1  247.7
2016  108.1  312.8  446.2  381.6

In [113]:
df1.loc[['2016','2015','2014']]

          봄     여름     가을     겨울
2016  312.8  446.2  381.6  108.1
2015  223.2  387.1  247.7  109.1
2014  215.9  599.8  293.1   76.9

## 데이터 통합하기

In [114]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 98, 100]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100

In [115]:
df2 = pd.DataFrame({'Class1': [76, 88],
                    'Class2': [100, 100]})
df2

   Class1  Class2
0      76     100
1      88     100

In [116]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100
0      76     100
1      88     100

In [117]:
df1.append(df2, ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100
4      76     100
5      88     100

In [120]:
df1.append(df2).reset_index()

   index  Class1  Class2
0      0      95      91
1      1      92      93
2      2      98      98
3      3     100     100
4      0      76     100
5      1      88     100

In [121]:
df1.append(df2).reset_index(drop=True)

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100
4      76     100
5      88     100

In [125]:
df3 = pd.DataFrame({
    'Class1':[80,10],
    'Class3':[50,60]
})
df3

   Class1  Class3
0      80      50
1      10      60

In [128]:
df1.append(df3, ignore_index=True, sort=True)

   Class1  Class2  Class3
0      95    91.0     NaN
1      92    93.0     NaN
2      98    98.0     NaN
3     100   100.0     NaN
4      80     NaN    50.0
5      10     NaN    60.0

In [129]:
df4 = pd.DataFrame({'Class3': [92,93,94,91,99]})
df4

   Class3
0      92
1      93
2      94
3      91
4      99

In [131]:
df1

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100

In [132]:
df1.join(df4) #주의해야할 점 : class3의 99점 사라짐. 짧은 쪽으로 통합이 됨.

   Class1  Class2  Class3
0      95      91      92
1      92      93      93
2      98      98      94
3     100     100      91

In [133]:
df1.join(df4, how='outer') #default가 how='inner'이기 때문 # how에 'left','right'도 있다. 알아두자.

   Class1  Class2  Class3
0    95.0    91.0      92
1    92.0    93.0      93
2    98.0    98.0      94
3   100.0   100.0      91
4     NaN     NaN      99

In [134]:

import random
month_list = [str(i)+'월' for i in range(1,5)]

prod_A, prod_B, prod_C, prod_D = [np.random.randint(50, 100, size=4) for i in range(4)]


df_A_B = pd.DataFrame({'판매월': month_list, 
                       '제품A': prod_A,
                       '제품B': prod_B})
df_A_B

  판매월  제품A  제품B
0  1월   54   82
1  2월   88   97
2  3월   87   55
3  4월   54   63

In [135]:
df_C_D = pd.DataFrame({'판매월': month_list,
                       '제품C': prod_C,
                       '제품D': prod_D})
df_C_D

  판매월  제품C  제품D
0  1월   57   80
1  2월   97   97
2  3월   76   91
3  4월   85   88

In [136]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월   54   82   57   80
1  2월   88   97   97   97
2  3월   87   55   76   91
3  4월   54   63   85   88

In [137]:
prod_E, prod_F = [np.random.randint(50, 100, size=4) for i in range(2)]
df_E_F = pd.DataFrame({'판매월': ['3월', '4월', '5월', '6월'],
                       '제품E': prod_E,
                       '제품F': prod_F})
df_E_F

  판매월  제품E  제품F
0  3월   91   87
1  4월   51   98
2  5월   89   50
3  6월   60   71

In [138]:
df_A_B.merge(df_E_F, how='left')

  판매월  제품A  제품B   제품E   제품F
0  1월   54   82   NaN   NaN
1  2월   88   97   NaN   NaN
2  3월   87   55  91.0  87.0
3  4월   54   63  51.0  98.0

In [139]:
df_A_B.merge(df_E_F, how='right')

  판매월   제품A   제품B  제품E  제품F
0  3월  87.0  55.0   91   87
1  4월  54.0  63.0   51   98
2  5월   NaN   NaN   89   50
3  6월   NaN   NaN   60   71

In [140]:
df_A_B.merge(df_E_F, how='inner')

  판매월  제품A  제품B  제품E  제품F
0  3월   87   55   91   87
1  4월   54   63   51   98

In [141]:
df_A_B.merge(df_E_F, how='outer')

  판매월   제품A   제품B   제품E   제품F
0  1월  54.0  82.0   NaN   NaN
1  2월  88.0  97.0   NaN   NaN
2  3월  87.0  55.0  91.0  87.0
3  4월  54.0  63.0  51.0  98.0
4  5월   NaN   NaN  89.0  50.0
5  6월   NaN   NaN  60.0  71.0

In [142]:
df_A_B.merge(df_E_F, how='outer', on="판매월")

  판매월   제품A   제품B   제품E   제품F
0  1월  54.0  82.0   NaN   NaN
1  2월  88.0  97.0   NaN   NaN
2  3월  87.0  55.0  91.0  87.0
3  4월  54.0  63.0  51.0  98.0
4  5월   NaN   NaN  89.0  50.0
5  6월   NaN   NaN  60.0  71.0

In [143]:
df_A_B.merge(df_E_F, how='outer', on='판매월')

  판매월   제품A   제품B   제품E   제품F
0  1월  54.0  82.0   NaN   NaN
1  2월  88.0  97.0   NaN   NaN
2  3월  87.0  55.0  91.0  87.0
3  4월  54.0  63.0  51.0  98.0
4  5월   NaN   NaN  89.0  50.0
5  6월   NaN   NaN  60.0  71.0

# 데이터 파일 읽고 쓰기

In [157]:
import os
BASE_DIR = os.getcwd()
DATASET_PATH = os.path.join(BASE_DIR, "datasets\\201904")
print(BASE_DIR)
print(DATASET_PATH)

C:\Users\Funzo\python gicho
C:\Users\Funzo\python gicho\datasets\201904

In [178]:
file1 = os.path.join(DATASET_PATH, "2019-04-30.csv")
df = pd.read_csv(file1, error_bad_lines=False, header=None)
df

b'Skipping line 18081: expected 8 fields, saw 11\n'

,0,1,2,3,4,5,6,7
0,2019-04-30,1545587997,C013010,점퍼,캘빈클라인진 19SS 신상 여성 항공점퍼 J211287,99500,NaN,NaN
1,2019-04-30,147567876,C013020,티셔츠,[모다아울렛][티엔지티]그레이 라운드넥 면 긴팔티셔츠TGTS9A103G2,55200,NaN,NaN
2,2019-04-30,897756527,A011060,땅콩,간단한 맥주안주 마른 군것질 견과 꿀땅콩 453g 간단,10970,NaN,NaN
3,2019-04-30,410494691,A019050,간장,간장(진 사조 옹가네 1.8L)X8 간장 진간장 식자재 업,36870,NaN,NaN
4,2019-04-30,223173815,C011020,남자상의,(색상 : 곤색 | 사이즈 : XL) FSSF18036 선염체크 버튼다운 남방 남자...,41070,NaN,NaN
5,2019-04-30,1173935366,A019180,즉석식품,(냉동)금호 쌀떡꼬치900g(10p)x15개(1box) 쌀떡꼬치 튀김류 떡꼬치 가공...,89160,NaN,NaN
6,2019-04-30,1476779724,C012050,여자하의,[빨질레리] 애쉬 울 블렌드 시어서커 셋업 팬츠 (PC9121UA14),181300,NaN,NaN
7,2019-04-30,1847125407,C014010,아동복,[압소바]라글랑화섬점퍼 AU3-53103,71200,NaN,NaN
8,2019-04-30,765016470,C012030,여자상의,[에스쏠레지아] 봄의 요정이 살포시 앉은 레이스와 프릴 블라우스_NC엑스코점,179000,NaN,NaN
9,2019-04-30,1093348192,E061060,살충제,[한국디비케이(주)] 킬파프 개미에어졸 뿌리는개미살충제 스프레이개미약,6350,NaN,NaN
10,2019-04-30,2116113448,C012050,여자하의,반에이크 ㄷ밑단커팅면바지 VA93DLM203Z,39800,NaN,NaN
11,2019-04-30,614125763,C013060,등산복,(옵션-사이즈 : K2 방한장갑 IMW12901-M) K2 방한장갑 IMW12901...,47000,NaN,NaN
12,2019-04-30,42902822,C011040,남자하의,[지오지아] 면혼방 프린트 하프팬츠 ABV2PH1105WT/ 지오지아,9000,NaN,NaN
13,2019-04-30,214930055,C013020,티셔츠,[세바스찬골프] 상하 반전 배색 스판 남성 카라넥 반팔티셔츠_243813,37905,37905.0,0.0
14,2019-04-30,384202521,I012050,컴퓨터소모품,[HP] 잉크 C8775WA (No.02/S라이트마젠타),18000,18000.0,0.0
15,2019-04-30,1146020498,C013020,티셔츠,(옵션1 : 블랙-XL) 810 데일리 폴링 반폴라티 DGO3295 여성빅사이즈티셔...,23000,NaN,NaN
16,2019-04-30,355123645,C013020,티셔츠,흡한속건 소매 메쉬 여성 하프넥 반팔티셔츠/골프웨어_244317,43130,43130.0,0.0
17,2019-04-30,721037017,L012110,색조화장품,[MAC]맥 플렌티 오브 파우트 플럼핑 립스틱[갤러리아],34000,NaN,NaN
18,2019-04-30,233236126,C014010,아동복,(색상 : 네이비5호) 아동원피스 벨트 원피스 KIDBOK-266 여아원피스 유아의...,20170,NaN,NaN
19,2019-04-30,1295113329,C011020,남자상의,[하프클럽/ZIOZIA](지오지아) 면혼방 체크 드레스셔츠 ABV1WC1103YE,6000,NaN,NaN
20,2019-04-30,1887159474,C012050,여자하의,[나이스크랍][AK구로점][나이스클랍] [18년 겨울]레오파드 스커트 N184PWKB99,219000,NaN,NaN
21,2019-04-30,619083649,C012050,여자하의,[반에이크]반에이크 블랙 베이직 큐롯팬츠 VA95SLQ304Z (VA95SLQ304Z),39800,NaN,NaN
22,2019-04-30,2140496746,C013020,티셔츠,[파파브로]남자 국산 스판 카라 패턴 티셔츠 LM-A9-253-그레이,29800,NaN,NaN
23,2019-04-30,129170450,C014010,아동복,[오렌지앤] 라임향품은코트_S-2XL(OJK73267),79200,NaN,NaN
24,2019-04-30,917251725,A021020,차,다미즐 제주 청귤차 1kg,7000,6820.0,-180.0
25,2019-04-30,1723482670,C021030,운동화,[나이키] (SIZE : 260) 에어 줌 페가수스 35(942851101) 런닝운...,153740,NaN,NaN
26,2019-04-30,343414417,C012010,여자외의,[하프클럽/매긴]양가죽숏라이더자켓MHDLJ101,198000,NaN,NaN
27,2019-04-30,1485277833,C012010,여자외의,[진도 Klever] 로얄 세이블 콤비 유색 밍크 코트(K2W3EC53_),4590000,NaN,NaN
28,2019-04-30,287212559,C013020,티셔츠,(색상 : 다홍 | 사이즈 : 110(2XL)) MTSS18095 숄더앤 바스트 포...,36270,NaN,NaN
29,2019-04-30,1973646101,C013060,등산복,(옵션 : 105(2XL)) 랜더스 라이트 폴라폴리스 자켓(JK430W) 블루 폴라...,34140,NaN,NaN
...,...,...,...,...,...,...,...,...
298820,2019-04-30,1511051984,C013020,티셔츠,[행텐] 남성 5부 포켓 티셔츠 (10170-031-461-05) NC아울렛,19800,NaN,NaN
298821,2019-04-30,2009086191,C012010,여자외의,[크로커다일레이디스][크로커다일레이디] 코트 CL9MCT102_BL (P000577...,129500,NaN,NaN
298822,2019-04-30,348004141,C012010,여자외의,[에꼴][18년 겨울]소매퍼 울코트(C91WCA001Z),383200,NaN,NaN
298823,2019-04-30,539666943,C014010,아동복,[모다아울렛][페리미츠]쿨맥스 옐로우티셔츠 P1825T533,9300,NaN,NaN
298824,2019-04-30,1530685344,L012040,치약,클리오 도라에몽 민트치약 80g x1,3500,3500.0,0.0
298825,2019-04-30,979302868,C013010,점퍼,[모다아울렛][앤듀](앤듀)홑겹 항공점퍼O185Z1001P,49000,NaN,NaN
298826,2019-04-30,1599670444,C021020,구두,[스미스마켓] 모스키노 페이던트 구두 여성구두,77000,NaN,NaN
298827,2019-04-30,780380817,C011040,남자하의,CP컴퍼니 19SS 06CMSS051A 103 렌즈 트레이닝 반바지,185480,NaN,NaN
298828,2019-04-30,817474478,C012010,여자외의,베이직 더블자켓 SV1JK37/ 숲,99500,NaN,NaN
298829,2019-04-30,1123426508,C013020,티셔츠,[캉골][AK분당점][캉골]키치 심볼 티셔츠 2592 네온,52000,NaN,NaN
298830,2019-04-30,966245842,C013020,티셔츠,헤지스골프 남성 블랙 컬러블록 반팔카라티셔츠 HUTS9B316BK/ 헤지스골프,142200,NaN,NaN
298831,2019-04-30,1926058617,C013020,티셔츠,[마인드브릿지]마인드브릿지 CP스판섭섭만세와펜포켓세미오버티셔츠 MTTS3163,39900,NaN,NaN
298832,2019-04-30,1995938056,C011020,남자상의,디스퀘어드2 셔츠(소매데님)프린팅 남방 중고 구제 캐주얼 배색 봄 가을 기본 남성용...,48000,NaN,NaN
298833,2019-04-30,1484669859,C013010,점퍼,[흄(HUM)]W몰 HUM 남여공용 코치자켓 바람막이점퍼 FHMECUV702P,10000,NaN,NaN
298834,2019-04-30,1779929690,C013010,점퍼,남성야상 남성점퍼 남자 야상점퍼 자켓 잠바 바람막이 숏 롱 간절기용 겨울용 탈부착 ...,92980,NaN,NaN
298835,2019-04-30,1485126001,C011020,남자상의,(color : NAVY | size : L_100) 체크 패턴 배색 데님 네이비 ...,37580,NaN,NaN
298836,2019-04-30,329101001,C014010,아동복,[젤리스푼]플라워롱티셔츠상하복,17900,NaN,NaN
298837,2019-04-30,776844370,C012050,여자하의,[오가게/아이우먼]아이우먼 밴딩 롤업 슬림핏진 MD4929M904 빅사이즈/ 아이우먼,46550,NaN,NaN
298838,2019-04-30,921326545,C012050,여자하의,[르샵] 일자핏 허리밴딩 면바지(LJ2PT607),71100,NaN,NaN
298839,2019-04-30,1589175955,C013010,점퍼,[SOUP]뒷판 자수 바람막이 후드 점퍼(SV4UJ90),99000,NaN,NaN
298840,2019-04-30,2006950378,C011040,남자하의,(사이즈 : M) JDP-068 베이직컬 하프팬츠-그레이 남성구제청바지 데님반바지 ...,30420,NaN,NaN
298841,2019-04-30,1734495884,L012060,샴푸,자양윤모 샴푸 샴푸 2종(지성두피용) 머리샴푸 머릿결관리 손상모발샴푸 머릿결샴푸 헤어관리,35620,NaN,NaN
298842,2019-04-30,1927456115,A013090,전복,[남해바다] 전복 1kg(13~15미),65900,65900.0,0.0
298843,2019-04-30,1029223867,C012050,여자하의,(옵션1 : 블랙-1) 804S 줄지 슬림 스커트 DCM1927 여성패션스커트 패션...,33360,NaN,NaN
298844,2019-04-30,1917998337,C013020,티셔츠,(색상 : 흰색 | 사이즈 : FREE) MTS-358 싱포 맨투맨 남성맨투맨티셔츠...,15420,NaN,NaN
298845,2019-04-30,815310680,C014010,아동복,[플레이키즈][플레이키즈프로][130-170] NSW 테크폴리스 여아 후디 (AMF...,89000,NaN,NaN
298846,2019-04-30,1747545991,C012030,여자상의,(더아이잗컬렉션) 프릴끈 장식 블라우스 CJ4A0BL42/ 아이잗컬렉션,169000,NaN,NaN
298847,2019-04-30,672400750,C011020,남자상의,(color : Mblue | size : L_100) 핸리넥 데님 블루 셔츠 _N...,37580,NaN,NaN
298848,2019-04-30,732785486,A019040,소금,함초 자연소금3kg,19100,19100.0,0.0
298849,2019-04-30,2118547344,C013040,청바지,[포에버21]디스트로이드 슬림핏 청바지/FOREVER21/청바지/일자핏,37000,NaN,NaN

In [179]:
df.columns = ['수집일자','상품ID','품목ID','품목명','상품명','판매가격','할인가격','혜택가격']

In [180]:
df2 = df[['수집일자', '품목명', '상품명','판매가격']]

In [181]:
df2.to_csv("temp.csv", encoding = "cp949") # 윈도우의 경우 저걸로 인코딩하면 읽어짐. 표준은 UTF-8

# 데이터 병합 연습

In [195]:
file1 = os.path.join(DATASET_PATH, "2019-04-01.csv")
df1 = pd.read_csv(file1, error_bad_lines=False, header=None)

for i in range(2,10):
    code='file{} = os.path.join(DATASET_PATH, "2019-04-0{}.csv")'.format(i,i)
    exec(code)
    code='df{} = pd.read_csv(file{}, error_bad_lines=False, header=None)'.format(i,i)
    exec(code)
    code = "df1=df1.append(df{})".format(i)
    exec(code)
for i in range(10,31):
    code='file{} = os.path.join(DATASET_PATH, "2019-04-{}.csv")'.format(i,i)
    exec(code)
    code='df{} = pd.read_csv(file{}, error_bad_lines=False, header=None)'.format(i,i)
    exec(code)
    code = "df1=df1.append(df{})".format(i)
    exec(code)

b'Skipping line 36560: expected 8 fields, saw 11\n'
b'Skipping line 222462: expected 8 fields, saw 11\n'
b'Skipping line 27894: expected 8 fields, saw 11\n'
b'Skipping line 45907: expected 8 fields, saw 11\n'
b'Skipping line 45538: expected 8 fields, saw 11\n'
b'Skipping line 89789: expected 8 fields, saw 11\n'
b'Skipping line 219259: expected 8 fields, saw 11\n'
b'Skipping line 129303: expected 8 fields, saw 11\n'
b'Skipping line 272309: expected 8 fields, saw 11\n'
b'Skipping line 211460: expected 8 fields, saw 11\n'
b'Skipping line 57879: expected 8 fields, saw 11\n'
b'Skipping line 170099: expected 8 fields, saw 11\n'
b'Skipping line 168991: expected 8 fields, saw 11\n'
b'Skipping line 61227: expected 8 fields, saw 11\n'
b'Skipping line 139967: expected 8 fields, saw 11\n'
b'Skipping line 61480: expected 8 fields, saw 11\n'
b'Skipping line 77728: expected 8 fields, saw 11\n'
b'Skipping line 271889: expected 8 fields, saw 11\n'
b'Skipping line 223096: expected 8 fields, saw 11\n'
b'Skipping line 104855: expected 8 fields, saw 11\n'
b'Skipping line 18081: expected 8 fields, saw 11\n'

In [ ]:
#위에꺼 약간 수정. 쓸데없는 포맷없앰.
file1 = os.path.join(DATASET_PATH, "2019-04-01.csv")
df1 = pd.read_csv(file1, error_bad_lines=False, header=None)

for i in range(2,10):
    code='file{} = os.path.join(DATASET_PATH, "2019-04-0{}.csv")'.format(i,i)
    exec(code)
    code='df = pd.read_csv(file{}, error_bad_lines=False, header=None)'.format(i)
    exec(code)
    code = "df1=df1.append(df)"
    exec(code)
for i in range(10,31):
    code='file{} = os.path.join(DATASET_PATH, "2019-04-{}.csv")'.format(i,i)
    exec(code)
    code='df = pd.read_csv(file{}, error_bad_lines=False, header=None)'.format(i)
    exec(code)
    code = "df1=df1.append(df)"
    exec(code)

In [196]:
df1

,0,1,2,3,4,5,6,7
0,2019-04-01,2142932948,C011020,남자상의,(사이즈 : RFCB2021 shirts 110) 슬림핏)링클프리 고급모달 블루 반...,44540,NaN,NaN
1,2019-04-01,1812194343,C013020,티셔츠,폴햄 공용슬럽브이넥반팔티셔츠(차콜) PHZ2TR3840,9900,NaN,NaN
2,2019-04-01,954865871,C014010,아동복,프렌치캣Q92DKJ040 연보라 프릴 바람막이JP,76000,NaN,NaN
3,2019-04-01,853175004,A021010,커피,[맥널티] 아이브루 케냐AA 30T+10T 인스턴트커피믹스 원두커피 케냐AA 인스턴...,16260,NaN,NaN
4,2019-04-01,826899644,A019050,간장,채선해 어간장 세트1(대멸치350g+어간장650ml) 어간장선물세트 실속선물세트 직...,37970,NaN,NaN
5,2019-04-01,1095655438,L012010,면도기,도루코페이스6면도날-4P SX-A1040 면도 얼굴면도기 도루코 도루코면도기 미용면도기,20450,NaN,NaN
6,2019-04-01,912133680,C011050,남자내의,Dossy 남성 드로즈 빅사이즈 110 120 남성드로즈팬티,16700,NaN,NaN
7,2019-04-01,176168123,C013010,점퍼,씨저스 퀼팅점퍼 1F2-1JE01-24,143000,NaN,NaN
8,2019-04-01,342609665,C011040,남자하의,스키니핏팬츠_1X511EP706NA,9900,NaN,NaN
9,2019-04-01,928928755,C021030,운동화,투벨크로 아동단화 운동화 아동화 아동운동화 어린이,27700,NaN,NaN
10,2019-04-01,814924610,E061100,습기제거제,[F] 첼로제습제 20g 10개 - 데시칸-B 친환경,2400,2280.0,-120.0
11,2019-04-01,1983249606,C013020,티셔츠,네이비 로고배색 면혼방 반팔카라티셔츠 HZTS9B003N2/ 헤지스,129000,NaN,NaN
12,2019-04-01,878389843,C012010,여자외의,케네스레이디 체크소매배색트렌치코트 EWTCJB0200,269000,NaN,NaN
13,2019-04-01,1126405207,C011040,남자하의,랜더스 바람막이 자켓(JK125) 코발트,29300,NaN,NaN
14,2019-04-01,1549553626,E061100,습기제거제,홈트너 옷장용제습제(120g) 습기제거제 제습제 10개,15210,NaN,NaN
15,2019-04-01,1904504950,A017300,미역,(2)미역(자른 차오름 1KG 국산)X5개/건미역 미역 말린,114520,NaN,NaN
16,2019-04-01,1073659289,C013010,점퍼,[써스데이아일랜드]배색 프린트 소매 숏 점퍼 (T194MJP232W)(경기점),249000,NaN,NaN
17,2019-04-01,1152942597,C014010,아동복,프렌치캣 Q92DCJ070 WH프릴 스카시 C.D,63000,NaN,NaN
18,2019-04-01,943429570,C011020,남자상의,[JEEP]남여공용 소매 배색 7부 티셔츠(JH2TSU064),18000,NaN,NaN
19,2019-04-01,420987991,A016160,과일가공품,[홈플러스]simplus_냉동체리칠레산_500G,5990,NaN,NaN
20,2019-04-01,1651601070,C012020,원피스,로즈민소매원피스 1025139 DRESS 쉬폰 레이스원피스,93370,NaN,NaN
21,2019-04-01,1066134397,C012010,여자외의,[르오트] (TV홈쇼핑방송/무료배송) 쿨링시크 냉감 밴딩 팬츠-사이즈 55∼88다양,5900,NaN,NaN
22,2019-04-01,1543762550,C014010,아동복,[ 빈 ] BT21TS05GN남아 포켓배색 그린 티셔츠,48000,NaN,NaN
23,2019-04-01,1773531765,C013010,점퍼,[올리비아하슬러]OH8MJP104 네크 셔링 점퍼,79900,NaN,NaN
24,2019-04-01,277908766,A019090,카레,[청정원] 병아리콩 빈달루 커리소스 360g 빈달루카레소스 병커리 인도식커리 커리소...,18170,NaN,NaN
25,2019-04-01,4343006,C013020,티셔츠,[반에이크]루즈핏 후드 티셔츠(VA94TSQ349Z_DG),39800,NaN,NaN
26,2019-04-01,1816679970,C012010,여자외의,SOUP 벨트 숏 트렌치 코트 SV4BB90,87000,NaN,NaN
27,2019-04-01,930687441,C011040,남자하의,지오다노 슬림핏 치노팬츠 117922,15000,NaN,NaN
28,2019-04-01,1919980648,I053050,필기구,[바보사랑]쿠츠와 제트스트림3 푸마 3색펜 0.5,9000,9000.0,0.0
29,2019-04-01,1025273168,A019180,즉석식품,두마리후라이드반반치킨,14990,14990.0,0.0
...,...,...,...,...,...,...,...,...
298820,2019-04-30,1511051984,C013020,티셔츠,[행텐] 남성 5부 포켓 티셔츠 (10170-031-461-05) NC아울렛,19800,NaN,NaN
298821,2019-04-30,2009086191,C012010,여자외의,[크로커다일레이디스][크로커다일레이디] 코트 CL9MCT102_BL (P000577...,129500,NaN,NaN
298822,2019-04-30,348004141,C012010,여자외의,[에꼴][18년 겨울]소매퍼 울코트(C91WCA001Z),383200,NaN,NaN
298823,2019-04-30,539666943,C014010,아동복,[모다아울렛][페리미츠]쿨맥스 옐로우티셔츠 P1825T533,9300,NaN,NaN
298824,2019-04-30,1530685344,L012040,치약,클리오 도라에몽 민트치약 80g x1,3500,3500.0,0.0
298825,2019-04-30,979302868,C013010,점퍼,[모다아울렛][앤듀](앤듀)홑겹 항공점퍼O185Z1001P,49000,NaN,NaN
298826,2019-04-30,1599670444,C021020,구두,[스미스마켓] 모스키노 페이던트 구두 여성구두,77000,NaN,NaN
298827,2019-04-30,780380817,C011040,남자하의,CP컴퍼니 19SS 06CMSS051A 103 렌즈 트레이닝 반바지,185480,NaN,NaN
298828,2019-04-30,817474478,C012010,여자외의,베이직 더블자켓 SV1JK37/ 숲,99500,NaN,NaN
298829,2019-04-30,1123426508,C013020,티셔츠,[캉골][AK분당점][캉골]키치 심볼 티셔츠 2592 네온,52000,NaN,NaN
298830,2019-04-30,966245842,C013020,티셔츠,헤지스골프 남성 블랙 컬러블록 반팔카라티셔츠 HUTS9B316BK/ 헤지스골프,142200,NaN,NaN
298831,2019-04-30,1926058617,C013020,티셔츠,[마인드브릿지]마인드브릿지 CP스판섭섭만세와펜포켓세미오버티셔츠 MTTS3163,39900,NaN,NaN
298832,2019-04-30,1995938056,C011020,남자상의,디스퀘어드2 셔츠(소매데님)프린팅 남방 중고 구제 캐주얼 배색 봄 가을 기본 남성용...,48000,NaN,NaN
298833,2019-04-30,1484669859,C013010,점퍼,[흄(HUM)]W몰 HUM 남여공용 코치자켓 바람막이점퍼 FHMECUV702P,10000,NaN,NaN
298834,2019-04-30,1779929690,C013010,점퍼,남성야상 남성점퍼 남자 야상점퍼 자켓 잠바 바람막이 숏 롱 간절기용 겨울용 탈부착 ...,92980,NaN,NaN
298835,2019-04-30,1485126001,C011020,남자상의,(color : NAVY | size : L_100) 체크 패턴 배색 데님 네이비 ...,37580,NaN,NaN
298836,2019-04-30,329101001,C014010,아동복,[젤리스푼]플라워롱티셔츠상하복,17900,NaN,NaN
298837,2019-04-30,776844370,C012050,여자하의,[오가게/아이우먼]아이우먼 밴딩 롤업 슬림핏진 MD4929M904 빅사이즈/ 아이우먼,46550,NaN,NaN
298838,2019-04-30,921326545,C012050,여자하의,[르샵] 일자핏 허리밴딩 면바지(LJ2PT607),71100,NaN,NaN
298839,2019-04-30,1589175955,C013010,점퍼,[SOUP]뒷판 자수 바람막이 후드 점퍼(SV4UJ90),99000,NaN,NaN
298840,2019-04-30,2006950378,C011040,남자하의,(사이즈 : M) JDP-068 베이직컬 하프팬츠-그레이 남성구제청바지 데님반바지 ...,30420,NaN,NaN
298841,2019-04-30,1734495884,L012060,샴푸,자양윤모 샴푸 샴푸 2종(지성두피용) 머리샴푸 머릿결관리 손상모발샴푸 머릿결샴푸 헤어관리,35620,NaN,NaN
298842,2019-04-30,1927456115,A013090,전복,[남해바다] 전복 1kg(13~15미),65900,65900.0,0.0
298843,2019-04-30,1029223867,C012050,여자하의,(옵션1 : 블랙-1) 804S 줄지 슬림 스커트 DCM1927 여성패션스커트 패션...,33360,NaN,NaN
298844,2019-04-30,1917998337,C013020,티셔츠,(색상 : 흰색 | 사이즈 : FREE) MTS-358 싱포 맨투맨 남성맨투맨티셔츠...,15420,NaN,NaN
298845,2019-04-30,815310680,C014010,아동복,[플레이키즈][플레이키즈프로][130-170] NSW 테크폴리스 여아 후디 (AMF...,89000,NaN,NaN
298846,2019-04-30,1747545991,C012030,여자상의,(더아이잗컬렉션) 프릴끈 장식 블라우스 CJ4A0BL42/ 아이잗컬렉션,169000,NaN,NaN
298847,2019-04-30,672400750,C011020,남자상의,(color : Mblue | size : L_100) 핸리넥 데님 블루 셔츠 _N...,37580,NaN,NaN
298848,2019-04-30,732785486,A019040,소금,함초 자연소금3kg,19100,19100.0,0.0
298849,2019-04-30,2118547344,C013040,청바지,[포에버21]디스트로이드 슬림핏 청바지/FOREVER21/청바지/일자핏,37000,NaN,NaN

In [227]:
file1

'C:\\Users\\Funzo\\python gicho\\datasets\\201904\\2019-04-01.csv'

In [229]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7972751 entries, 0 to 298849
Data columns (total 8 columns):
0    object
1    int64
2    object
3    object
4    object
5    int64
6    float64
7    float64
dtypes: float64(2), int64(2), object(4)
memory usage: 547.4+ MB

In [230]:
df1.head()

,0,1,2,3,4,5,6,7
0,2019-04-01,2142932948,C011020,남자상의,(사이즈 : RFCB2021 shirts 110) 슬림핏)링클프리 고급모달 블루 반...,44540,NaN,NaN
1,2019-04-01,1812194343,C013020,티셔츠,폴햄 공용슬럽브이넥반팔티셔츠(차콜) PHZ2TR3840,9900,NaN,NaN
2,2019-04-01,954865871,C014010,아동복,프렌치캣Q92DKJ040 연보라 프릴 바람막이JP,76000,NaN,NaN
3,2019-04-01,853175004,A021010,커피,[맥널티] 아이브루 케냐AA 30T+10T 인스턴트커피믹스 원두커피 케냐AA 인스턴...,16260,NaN,NaN
4,2019-04-01,826899644,A019050,간장,채선해 어간장 세트1(대멸치350g+어간장650ml) 어간장선물세트 실속선물세트 직...,37970,NaN,NaN

In [231]:
df1.tail()

,0,1,2,3,4,5,6,7
298845,2019-04-30,815310680,C014010,아동복,[플레이키즈][플레이키즈프로][130-170] NSW 테크폴리스 여아 후디 (AMF...,89000,NaN,NaN
298846,2019-04-30,1747545991,C012030,여자상의,(더아이잗컬렉션) 프릴끈 장식 블라우스 CJ4A0BL42/ 아이잗컬렉션,169000,NaN,NaN
298847,2019-04-30,672400750,C011020,남자상의,(color : Mblue | size : L_100) 핸리넥 데님 블루 셔츠 _N...,37580,NaN,NaN
298848,2019-04-30,732785486,A019040,소금,함초 자연소금3kg,19100,19100.0,0.0
298849,2019-04-30,2118547344,C013040,청바지,[포에버21]디스트로이드 슬림핏 청바지/FOREVER21/청바지/일자핏,37000,NaN,NaN

In [220]:
len(df1)

7972751

In [219]:
len(df1[df1[3]=='남자상의'])

374346

In [213]:
man_top = df1[df1[3]=='남자상의']
man_top.to_csv("man_top.csv",encoding = "cp949")

In [226]:
#정답코드 만들기 전 날짜인덱스 만들어보기
for x in pd.date_range('2019-04-01', periods = 10, freq = 'D'):
    print(x.strftime('%Y-%m-%d'))

2019-04-01
2019-04-02
2019-04-03
2019-04-04
2019-04-05
2019-04-06
2019-04-07
2019-04-08
2019-04-09
2019-04-10

In [ ]:
#이거 실행하면 또 통합본 만듦
#이게 더 메모리 절약할듯...
initial_file = os.path.join(DATASET_PATH, "2019-04-01.csv")

o_df = pd.read_csv(initial_file, header = None, error_bad_lines = False)
for x in pd.date_range('2019-04-01', periods = 29, freq = 'D'):
    date=(x.strftime('%Y-%m-%d'))
    filename="{}.csv".format(date)
    
    filepath = os.path.join(DATASET_PATH, filename)
    df=pd.read_csv(filepath, header=None, error_bad_lines = False)
    o_df = o_df.append(df)

In [228]:
#위 코드 중 윗부분 실험

initial_file = os.path.join(DATASET_PATH, "2019-04-01.csv")

o_df = pd.read_csv(initial_file, header = None, error_bad_lines = False)
o_df.info()

b'Skipping line 36560: expected 8 fields, saw 11\n'

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208747 entries, 0 to 208746
Data columns (total 8 columns):
0    208747 non-null object
1    208747 non-null int64
2    208747 non-null object
3    208747 non-null object
4    208747 non-null object
5    208747 non-null int64
6    26633 non-null float64
7    26633 non-null float64
dtypes: float64(2), int64(2), object(4)
memory usage: 12.7+ MB